<?php
/**
 * Created by PhpStorm.
 * User: DELL
 * Date: 09.10.2016
 * Time: 20:14
 */

	//Все месяцы не пишу для краткости
	$arr = array('Січень', 'Лютий', 'Березень', 'Квітень','Травень', 'Червень', 'Липень', 'Серпень','Вересень', 'Жовтень', 'Листопад', 'Грудень');
	$month = 10; //пусть будет текущим месяцем
	foreach ($arr as $key => $elem)
    {
        if ($key == $month - 1)
        {
            echo "<b>$elem</b><br>";
        }
        else
        {
            echo $elem.'<br>';
        }
    }
?>